netify-soap/src/test/resources/soap/requests/actor/UpdateActorRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general"
                  xmlns:act="http://duo.nl/namespace/netify/datatypes/actor">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:UpdateActorRequest>
            <gen:actor>
                <act:id>16483</act:id>
                <act:name>Sylvester Stallone</act:name>
                <act:gender>MALE</act:gender>
            </gen:actor>
        </gen:UpdateActorRequest>
    </soapenv:Body>
</soapenv:Envelope>